Rainchus/marioparty4/src/REL/m409Dll/player.c
#include "REL/m409Dll.h"

#include "math.h"
#include "ext_math.h"
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework_data.h"
#include "game/pad.h"
#include "game/hsfmotion.h"

// bss
omObjData* lbl_1_bss_3A0[4];
omObjData* lbl_1_bss_39C;
s32 lbl_1_bss_38C[4];
unkStruct10 lbl_1_bss_10C[8];
s16 lbl_1_bss_108;
s16 lbl_1_bss_106;
s16 lbl_1_bss_104;
unkStruct9 lbl_1_bss_F0;

// data
u32 lbl_1_data_138 = 0xFFFF0000;
s32 lbl_1_data_13C[7] = { 0x30, 0x2D, 0x3A, 0x2E, DATA_MAKE_NUM(DATADIR_M409, 0x32), 0x17, 0x18 };
GXColor lbl_1_data_158[8] = {
    { 0xFF, 0x00, 0x00, 0xFF },
    { 0x00, 0x00, 0xFF, 0xFF },
    { 0xFF, 0x80, 0x80, 0xFF },
    { 0x00, 0xFF, 0x00, 0xFF },
    { 0x80, 0x00, 0xC0, 0xFF },
    { 0x90, 0x30, 0x00, 0xFF },
    { 0xFF, 0xFF, 0x00, 0xFF },
    { 0x00, 0x00, 0x00, 0xFF }
};
HsfVector2f lbl_1_data_178[4] = {
    { 72.0f, 80.0f }, { 504.0f, 80.0f },
    { 72.0f, 400.0f }, { 504.0f, 400.0f },
};
GXColor lbl_1_data_198[8] = {
    { 0xD0, 0x00, 0x00, 0xFF },
    { 0x00, 0x00, 0xFF, 0xFF },
    { 0x00, 0xA0, 0x00, 0xFF },
    { 0xFF, 0xFF, 0x00, 0xFF },
    { 0xA0, 0x00, 0xFF, 0xFF },
    { 0xFF, 0x80, 0x40, 0xFF },
    { 0xFF, 0xA0, 0xF0, 0xFF },
    { 0x00, 0xFF, 0x40, 0xFF }
};

void fn_1_67E0(Process* arg0) {
    s32 var_r31;
    s32 temp_r28;
    omObjData* var_r30;

    omMakeGroupEx(arg0, 0, 4);
    omGetGroupMemberListEx(arg0, 0);
    
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        lbl_1_bss_3A0[var_r31] = var_r30 = omAddObjEx(arg0, 0x30, 3, 7, 0, fn_1_6928);
        var_r30->work[0] = var_r31;
    }
    lbl_1_bss_39C = var_r30 = omAddObjEx(arg0, 0x40, 8, 0xA, 4, fn_1_91C0);
    fn_1_BF88(0x40, 0x40);
    fn_1_DF20(DATA_MAKE_NUM(DATADIR_M409, 0x2C), 0x40, 0x40);
    temp_r28 = (u8)frand();
    
    for (var_r31 = 0; var_r31 < (temp_r28 + 1); var_r31++) {
        fn_1_ABB4();
    }
}

void fn_1_6900(void) {
    CharModelKill(-1);
    fn_1_C0C0();
}

void fn_1_6928(omObjData* arg0) {
    Vec sp8[4] = {
        { -185.0f, 35.0f, 100.0f },
        { -62.5f,  35.0f, 100.0f },
        { 62.5f,   35.0f, 100.0f },
        { 185.0f,  35.0f, 100.0f }
    };
    s8 sp38[8][32] = {
        "test11_tex_we-itemhook-r",
        "test11_tex_we-itemhook-r",
        "test11_tex_we-itemhook-r",
        "test11_tex_we-itemhook-r",
        "test11_tex_we-itemhook-r",
        "test11_tex_we-itemhook-r",
        "test11_tex_we-itemhook-r",
        "test11_tex_we-itemhook-r"
    };
    unkStruct7* var_r31;
    s32 var_r30;
    s32 var_r28;
    
    var_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(unkStruct7), MEMORY_DEFAULT_NUM);
    arg0->data = var_r31;
    var_r31->unk0 = arg0->work[0];
    var_r31->unk1 = GWPlayerCfg[var_r31->unk0].character;
    var_r31->unk2 = (var_r31->unk0 >> 1);
    var_r31->unk3 = (var_r31->unk0 & 1);
    var_r31->unk4 = GWPlayerCfg[var_r31->unk0].pad_idx;
    var_r31->unk5 = GWPlayerCfg[var_r31->unk0].iscom;
    var_r31->unk6 = GWPlayerCfg[var_r31->unk0].diff;
    var_r31->unk1C = 0;
    var_r31->unk13 = 1;
    var_r31->unk14 = 0;
    var_r31->unk61 = fn_1_ABB4() & 0x1;
    var_r31->unk64 = var_r31->unk63 = 0;
    var_r31->unk18 = -1;
    var_r31->unk24.x = sp8[var_r31->unk0].x;
    var_r31->unk24.y = sp8[var_r31->unk0].y;
    var_r31->unk24.z = sp8[var_r31->unk0].z;
    var_r31->unk30.x = var_r31->unk30.y = var_r31->unk30.z = 0.0f;
    var_r31->unk3C.y = 180.0f;
    var_r31->unk3C.x = var_r31->unk3C.z = 0.0f;
    var_r30 = CharModelCreate(var_r31->unk1, 4);
    arg0->model[0] = var_r30;
    Hu3DModelAttrSet(var_r30, 0x40000001);
    
    for (var_r28 = 0; var_r28 < 7; var_r28++) {
        if ((lbl_1_data_13C[var_r28] & 0xFFFF0000) != 0) {
            arg0->motion[var_r28] = CharModelMotionCreate(var_r31->unk1, var_r31->unk1 + lbl_1_data_13C[var_r28]);
        } else {
            arg0->motion[var_r28] = CharModelMotionCreate(var_r31->unk1, lbl_1_data_13C[var_r28]);
        }
    }
    CharModelMotionDataClose(var_r31->unk1);
    CharModelMotionSet(var_r31->unk1, arg0->motion[var_r31->unk1C]);
    omSetTra(arg0, var_r31->unk24.x, var_r31->unk24.y, var_r31->unk24.z);
    Hu3DModelPosSet(var_r30, var_r31->unk24.x, var_r31->unk24.y, var_r31->unk24.z);
    Hu3DModelRotSet(var_r30, 0.0f, 30.0f, 0.0f);
    CharModelStepTypeSet(var_r31->unk1, 0);
    arg0->model[1] = var_r30 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x12));
    Hu3DModelHookSet(arg0->model[0], (char*)sp38[var_r31->unk1], arg0->model[1]);
    var_r30 = fn_1_DA48(2, 1);
    var_r31->unk57 = var_r30;
    lbl_1_bss_F0.unk10[var_r30].unk30 = fn_1_8838;
    fn_1_E2A8(var_r30, 0, DATA_MAKE_NUM(DATADIR_M409, 0x2B), 0x40, 0x40);
    fn_1_F098(var_r30, lbl_1_data_158[var_r31->unk1].r, lbl_1_data_158[var_r31->unk1].g, lbl_1_data_158[var_r31->unk1].b, lbl_1_data_158[var_r31->unk1].a);
    fn_1_F024(var_r30, 1, lbl_1_data_158[var_r31->unk1].r, lbl_1_data_158[var_r31->unk1].g, lbl_1_data_158[var_r31->unk1].b, 0x98);
    fn_1_E85C(var_r30, 0, var_r31->unk24.x, 100.0f + var_r31->unk24.y, -1200.0f);
    fn_1_ED44(var_r30, 0, 0x10);
    fn_1_EC1C(var_r30, 0, 2.0f, 2.0f, 1.0f);
    fn_1_EC1C(var_r30, 1, 2.5f, 2.5f, 1.0f);
    fn_1_ED44(var_r30, 1, 0x14);
    fn_1_F408(var_r30, 1, 1);
    var_r30 = fn_1_DA48(1, 1);
    fn_1_DEF4(var_r30, 0, 0);
    fn_1_E7C8(lbl_1_bss_F0.unk6, 0, DATA_MAKE_NUM(DATADIR_M409, 0x2D));
    var_r31->unk58 = var_r30;
    lbl_1_bss_F0.unk10[var_r30].unk30 = &fn_1_8D6C;
    fn_1_ED44(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 4);
    lbl_1_bss_F0.unk10[lbl_1_bss_F0.unk6].unk3C[lbl_1_bss_F0.unk8].unk70[0] = var_r31->unk0;
    lbl_1_bss_F0.unk10[lbl_1_bss_F0.unk6].unk3C[lbl_1_bss_F0.unk8].unk70[1] = -1;
    fn_1_EC1C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 0.5f, 0.5f, 1.0f);
    var_r31->unk59 = 0;
    var_r31->unk60 = 0;
    var_r30 = espEntry(DATA_MAKE_NUM(DATADIR_M409, 0x31), 1, 0);
    var_r31->unk55 = var_r30;
    espColorSet(var_r30, 0, 0, 0);
    espTPLvlSet(var_r30, 0.5);
    espPosSet(var_r30, lbl_1_data_178[var_r31->unk0].x, lbl_1_data_178[var_r31->unk0].y);
    espAttrSet(var_r30, 4);
    var_r30 = espEntry(DATA_MAKE_NUM(DATADIR_M409, 0x30), 1, 0);
    var_r31->unk54 = var_r30;
    espPosSet(var_r30, lbl_1_data_178[var_r31->unk0].x, lbl_1_data_178[var_r31->unk0].y);
    espAttrSet(var_r30, 4);
    var_r30 = espEntry(var_r31->unk1 + DATA_MAKE_NUM(DATADIR_MGCONST, 0x00), 1, 0);
    var_r31->unk56 = var_r30;
    espPosSet(var_r30, lbl_1_data_178[var_r31->unk0].x - 27.0f, lbl_1_data_178[var_r31->unk0].y - 20.0f);
    espAttrSet(var_r30, 4);
    
    for (var_r28 = 0; var_r28 < 3; var_r28++) {
        var_r30 = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 0x0A), 0, 0);
        var_r31->unk5A[var_r28][0] = var_r30;
        espAttrSet(var_r30, 4);
        espPosSet(var_r30, lbl_1_data_178[var_r31->unk0].x - 32.0f + (var_r28 * 0x1E), 16.0f + lbl_1_data_178[var_r31->unk0].y);
        var_r30 = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 0x0B), 0, 0);
        var_r31->unk5A[var_r28][1] = var_r30;
        espAttrSet(var_r30, 4);
        espPosSet(var_r30, lbl_1_data_178[var_r31->unk0].x - 32.0f + (var_r28 * 0x1E), 16.0f + lbl_1_data_178[var_r31->unk0].y);
    }
    arg0->func = fn_1_7344;
}

