Rainchus/marioparty4/src/REL/m409Dll/player.c
void fn_1_91C0(omObjData* arg0) {
    s32 var_r28;
    s32 var_r30;
    unkStruct10* var_r31;

    lbl_1_bss_108 = 0;
    var_r28 = Hu3DModelCreateFile(0x20000);
    arg0->model[0] = var_r28;
    Hu3DModelAttrSet(var_r28, 0x40000001);

    for (var_r30 = 0; var_r30 < 3; var_r30++) {
        arg0->motion[var_r30] = Hu3DJointMotion(var_r28, HuDataSelHeapReadNum(var_r30 + DATA_MAKE_NUM(DATADIR_M409, 0x0F), MEMORY_DEFAULT_NUM, HEAP_DATA));
    }
    Hu3DMotionSet(var_r28, arg0->motion[0]);
    omSetTra(arg0, 419.99997f, 250.0f, -180.0f);
    omSetRot(arg0, 0.0f, -30.0f, 0.0f);
    
    for (var_r30 = 0; var_r30 < 4; var_r30++) {
        arg0->work[var_r30] = 0;
    }
    
    for (var_r30 = 0; var_r30 < 8; var_r30++) {
        var_r28 = Hu3DModelCreateFile(var_r30 + DATA_MAKE_NUM(DATADIR_M409, 0x1B));
        arg0->model[var_r30 + 1] = var_r28;
        Hu3DModelAttrSet(var_r28, 1);
    }
    lbl_1_bss_104 = 0;
    
    
    for (var_r31 = lbl_1_bss_10C, var_r30 = 0; var_r30 < 8; var_r30++, var_r31++) {
        var_r28 = Hu3DModelCreateFile(var_r30 + DATA_MAKE_NUM(DATADIR_M409, 0x13));
        var_r31->unk0 = var_r28;
        Hu3DModelLayerSet(var_r28, 3);
        var_r31->unkC.x = -400.0f + (100.0f * var_r30);
        var_r31->unkC.y = 300.0f + (100.0f * var_r30);
        var_r31->unkC.z = -1200.0f;
        Hu3DModelPosSet(var_r28, var_r31->unkC.x, var_r31->unkC.y, var_r31->unkC.z);
        var_r31->unk2 = var_r31->unk3 = 0;
        var_r31->unk18.x = var_r31->unk18.y = var_r31->unk18.z = 0.0f;
        var_r31->unk24.x = var_r31->unk24.y = var_r31->unk24.z = 1.0f;
        var_r31->unk3C.x = var_r31->unk3C.y = var_r31->unk3C.z = 0.0f;
        var_r31->unk30.x = var_r31->unkC.x;
        var_r31->unk30.y = var_r31->unkC.y;
        var_r31->unk30.z = var_r31->unkC.z;
        var_r31->unk48 = var_r30;
        fn_1_DEF4((var_r31->unk1 = fn_1_DA48(1, 1)), 0, 0);
        fn_1_E2A8(lbl_1_bss_F0.unk6, 0, var_r30 + DATA_MAKE_NUM(DATADIR_M409, 0x23), 0x40, 0x40);
        fn_1_EC1C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 2.0f, 2.0f, 1.0f);
        fn_1_F024(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 0xFF, 0xFF, 0xFF, 0xA0);
        fn_1_ED44(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 0x40000004);
        fn_1_F17C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, lbl_1_bss_F0.unkA, 0x11);
        fn_1_F2F8(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, lbl_1_bss_F0.unkA, 1.0f);
    }
    arg0->func = fn_1_962C;
}

void fn_1_962C(omObjData* arg0) {
    s32 sp8[7];
    unkStruct10* var_r31;
    s32 var_r29;
    s32 var_r28;
    s32 var_r27;
    s32 var_r26;
    f32 var_f31;
    
    var_r27 = 0;
    var_r31 = &lbl_1_bss_10C[0];

    switch (lbl_1_bss_108) {
        case 0:
            if (fn_1_2454(0x18) == 8) {
                lbl_1_bss_108++;
            }
            for (var_r29 = 0; var_r29 < 4; var_r29++) {
                if (lbl_1_bss_38C[var_r29] == 0) break;
            }
            if (var_r29 < 4) break;
            if (lbl_1_bss_104 == 0) break;
            
            lbl_1_bss_108 = 6;
            break;
        case 1:
            arg0->work[0] = (s32)((fn_1_ABB4() / 65536.0f) * 3.0f) + 6;
            arg0->work[1] = lbl_1_bss_106 = (u16)((fn_1_ABB4() / 65536.0f) * *arg0->work);
            arg0->work[2]++;
            if (arg0->work[2] >= 12) {
                lbl_1_bss_104 = -1;
            }
            arg0->work[3] = 0;
            for (var_r29 = 0; var_r29 < arg0->work[0]; var_r29++, var_r31++) {
                var_r31->unk2 = 1;
            }
            lbl_1_bss_108++;
            break;
        case 3:
            var_r26 = arg0->model[lbl_1_bss_106 + 1];
            Hu3DModelAttrReset(var_r26, 1);
            Hu3DModelHookSet(arg0->model[0], "g001mk-itemhook_r", var_r26);
            Hu3DMotionShiftSet(arg0->model[0], arg0->motion[1], 0.0f, 8.0f, 0);
            HuAudFXPlay(0x558);
            lbl_1_bss_108++;
            for (var_r29 = 0; var_r29 < 4; var_r29++) {
                lbl_1_bss_38C[var_r29] = 0;
            }
            fn_1_2414(0x18, 0x10);
            break;
        case 5:
            if (arg0->work[3] == 0) {
                fn_1_AC08(sp8, arg0->work[0]);
                for (var_r29 = 0, var_r28 = 1; var_r29 < arg0->work[0]; var_r29++) {
                    var_r31 = &lbl_1_bss_10C[sp8[var_r29]];
                    if (var_r31->unk2 == 3) {
                        var_r31->unk2 = 4;
                        var_r31->unk4 = var_r28 * 10;
                        var_r28++;
                    }
                }
                arg0->work[3] = var_r28 * 10 + 10;
                Hu3DMotionShiftSet(arg0->model[0], arg0->motion[2], 0.0f, 8.0f, 0);
                if (lbl_1_bss_104 == 0) {
                    fn_1_3840();
                }
                break;
            }
            if (--arg0->work[3] == 0) {
                lbl_1_bss_108 = 0;
                Hu3DModelHookReset(arg0->model[0]);
                Hu3DMotionShiftSet(arg0->model[0], arg0->motion[0], 0.0f, 8.0f, 0x40000001);
                Hu3DModelAttrSet(arg0->model[lbl_1_bss_106 + 1], 1);
            }
            break;
        case 6:
            fn_1_2414(7, 4);
            fn_1_23EC(lbl_1_bss_104- 1);
            lbl_1_bss_108++;
            break;
        case 7:
            break;
    }

    var_r31 = &lbl_1_bss_10C[0];
    for (var_r29 = 0; var_r29 < 8; var_r29++, var_r31++) {
        fn_1_DEF4(var_r31->unk1, 0, 0);

        switch (var_r31->unk2) {
            case 0:
                Hu3DModelAttrSet(var_r31->unk0, 1);
                var_r31->unkC.x = var_r31->unkC.y = var_r31->unkC.z = 0.0f;
                continue;
            case 1:
                var_r31->unkC.x = ((fn_1_ABB4() - 0x8000) / 32768.0f) * 150.0f;
                var_r31->unkC.y = (fn_1_ABB4() / 65536.0f) * 100.0f;
                var_r31->unkC.z = -1200.0f;
                Hu3DModelPosSet(var_r31->unk0, var_r31->unkC.x, var_r31->unkC.y, var_r31->unkC.z);
                Hu3DModelAttrSet(var_r31->unk0, 1);
                fn_1_EC1C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 2.0f, 2.0f, 1.0f);
                var_r31->unk18.z = ((fn_1_ABB4() - 0x8000) / 32768.0f) * 60.0f;
                var_r31->unk4 = ((100.0f - var_r31->unkC.y) * 0.5f);
                var_r31->unk8 = 100.0f * ((((fn_1_ABB4() / 65536.0f) * 0.006f) + 0.0128f) + (0.000035f * var_r31->unk4));
                var_r31->unk4C = ((fn_1_ABB4() - 0x8000) / 32768.0f) * 360.0f;
                var_r31->unk2++;
            case 2:
                if (--var_r31->unk4 != 0) break;
                var_r31->unk4 = 1;
                var_r31->unk2++;
            case 3:
                if (var_r31->unk18.z < 0.0f) {
                    var_r31->unk18.z += 0.08f;
                    if (var_r31->unk18.z >= 0.0f) {
                        var_r31->unk18.z = 0.0f;
                    }
                } else {
                    var_r31->unk18.z -= 0.08f;
                    if (var_r31->unk18.z <= 0.0f) {
                        var_r31->unk18.z = 0.0f;
                    }
                }
                if (var_r31->unkC.y >= 375.0f) {
                    var_r31->unk8 -= 0.000001f * var_r31->unkC.y;
                }
                var_r31->unkC.x += sind(var_r31->unk18.z) * var_r31->unk8;
                var_r31->unkC.y += cosd(var_r31->unk18.z) * var_r31->unk8;
                if (var_r31->unkC.y >= 200.0) {
                    Hu3DModelAttrReset(var_r31->unk0, 1);
                }
                if (var_r31->unkC.x >= 550.0f) {
                    var_r31->unk18.z = -((fn_1_ABB4() / 65536.0f) * 20.0f);
                }
                if (var_r31->unkC.x <= -550.0f) {
                    var_r31->unk18.z = ((fn_1_ABB4() / 65536.0f) * 20.0f);
                }
                if (var_r31->unkC.y >= 1250.0f) {
                    var_r31->unk2 = 4;
                }
                break;
            case 4:
                if (--var_r31->unk4 != 0) break;
                Hu3DModelAttrSet(var_r31->unk0, 1);
                fn_1_E85C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, var_r31->unkC.x, var_r31->unkC.y, var_r31->unkC.z);
                fn_1_EE68(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 4);
                if (lbl_1_bss_106 == var_r31->unk48) {
                    HuAudFXPlay(0x557);
                } else {
                    HuAudFXPlay(0x55A);
                }
                if (var_r31->unk48 == arg0->work[1]) {
                    lbl_1_bss_108 = 5;
                }
                var_r26 = fn_1_DA48(1, 1);
                fn_1_DEF4(var_r26, 0, 0);
                fn_1_E7C8(lbl_1_bss_F0.unk6, 0, DATA_MAKE_NUM(DATADIR_M409, 0x2C));
                fn_1_E85C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, var_r31->unkC.x, var_r31->unkC.y, var_r31->unkC.z);
                fn_1_EC1C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 4.0f, 4.0f, 1.0f);
                fn_1_ED44(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 0x80000000);
                fn_1_F024(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 0xFF, 0xFF, 0xFF, 0x60);
                fn_1_F17C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, lbl_1_bss_F0.unkA, 0x11);
                fn_1_F2F8(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, lbl_1_bss_F0.unkA, 0.5f);
                var_r31->unk2++;
                break;
            case 5:
                var_r31->unk4++;
                fn_1_EC1C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, (var_r31->unk4 * 0.1f) + 2.0f, (var_r31->unk4 * 0.1f) + 2.0f, 1.0f);
                var_r31->unkC.x = var_r31->unkC.y = var_r31->unkC.z = 0.0f;
                break;
        }
        if (var_r31->unkC.y <= 375.0f) {
            if (var_r31->unkC.x >= 150.0f) {
                var_r31->unkC.x = 150.0f;
            }
            if (var_r31->unkC.x <= -150.0f) {
                var_r31->unkC.x = -150.0f;
            }
        } else {
            var_r27++;
        }

        fn_1_A584(var_r31);
        Hu3DModelPosSet(var_r31->unk0, var_r31->unkC.x, var_r31->unkC.y, var_r31->unkC.z);
        var_f31 = sin((var_r31->unk4C * M_PI) / 180.0);
        var_r31->unk4C += 3.0f;
        Hu3DModelRotSet(var_r31->unk0, 8.0 * sin((var_r31->unk4C * 0.3 * M_PI) / 180.0), var_r31->unk4C * 0.05f, (-var_r31->unk18.z * 0.25f) + (var_f31 * 8.0f));
    }
    
    if (lbl_1_bss_108 == 2 && var_r27 >= arg0->work[0]) {
        lbl_1_bss_108++;
    }
    (void)var_r27;
}

s32 fn_1_A584(unkStruct10* arg0) {
    s32 sp20[8];
    Vec sp14;
    Vec sp8;
    f32 temp_f29;
    f32 temp_f30;
    f32 var_f31;
    s32 var_r28;
    s32 var_r29;
    unkStruct10* var_r31;

    if ((arg0->unk2 == 0) || (arg0->unk2 >= 4U)) {
        return 0;
    }
    temp_f29 = 100.0f;
    var_r28 = 0;
    sp14.x = sp14.y = sp14.z = 0.0f;
    var_r31 = lbl_1_bss_10C;
    
    for (var_r29 = 0; var_r29 < 8; var_r29++, var_r31++) {
        if ((var_r31->unk2 != 0) && (var_r31->unk2 < 4U) && (var_r31 != arg0)) {
            sp8.x = arg0->unkC.x - var_r31->unkC.x;
            sp8.y = arg0->unkC.y - var_r31->unkC.y;
            sp8.z = arg0->unkC.z - var_r31->unkC.z;
            temp_f30 = fn_1_B378(&sp8);
            if (!(temp_f30 > temp_f29)) {
                sp20[var_r28] = var_r29;
                var_r28 += 1;
                sp14.x += 0.5f * (sp8.x * (temp_f29 - temp_f30));
                sp14.y += 0.5f * (sp8.y * (temp_f29 - temp_f30));
                sp14.z += 0.5f * (sp8.z * (temp_f29 - temp_f30));
            }
        }
    }
    if (var_r28 == 0) {
        return 0;
    }
    arg0->unkC.x += sp14.x;
    arg0->unkC.y += sp14.y;
    arg0->unkC.z += sp14.z;
    var_f31 = (180.0 * (atan2(sp14.x, sp14.y) / M_PI));
    if (var_f31 > 180.0f) {
        var_f31 -= 360.0f;
    }
    if (var_f31 > 60.0f) {
        var_f31 = 60.0f;
    }
    if (var_f31 < -60.0f) {
        var_f31 = -60.0f;
    }
    arg0->unk18.z = var_f31 = fn_1_AD40(arg0->unk18.z, var_f31, 0.5f);
    var_r31 = lbl_1_bss_10C;
    
    for (var_r29 = 0; var_r29 < 8; var_r29++, var_r31++) {
        if ((var_r31 != arg0) && (var_r31->unk2 != 0) && (var_r31->unk2 < 4U)) {
            sp8.x = var_r31->unkC.x - arg0->unkC.x;
            sp8.y = var_r31->unkC.y - arg0->unkC.y;
            sp8.z = var_r31->unkC.z - arg0->unkC.z;
            temp_f30 = fn_1_B378(&sp8);
            if (!(temp_f30 > temp_f29)) {
                var_r31->unkC.x += sp8.x * (temp_f29 - temp_f30);
                var_r31->unkC.y += sp8.y * (temp_f29 - temp_f30);
                var_r31->unkC.z += sp8.z * (temp_f29 - temp_f30);
                var_f31 = (180.0 * (atan2(sp8.x, sp8.y) / M_PI));
                if (var_f31 > 180.0f) {
                    var_f31 -= 360.0f;
                }
                if (var_f31 > 60.0f) {
                    var_f31 = 60.0f;
                }
                if (var_f31 < -60.0f) {
                    var_f31 = -60.0f;
                }
                var_r31->unk18.z = var_f31 = fn_1_AD40(var_r31->unk18.z, var_f31, 0.5f);
            }
        }
    }
    return 1;
}

s8 fn_1_A9C0(Vec* arg0, f32* arg1) {
    f32 sp8;
    f32 temp_f29;
    f32 var_f30;
    f32 var_f28;
    s32 var_r27;
    s32 var_r29;
    unkStruct10* var_r31;

    var_r27 = -1;
    var_r31 = lbl_1_bss_10C;
    var_f30 = *arg1;
    var_f30 *= var_f30;
    
    for (var_r29 = 0; var_r29 < 8; var_r29++, var_r31++) {
        if (((Hu3DModelAttrGet(var_r31->unk0) & 1) == 0) && !(var_r31->unkC.y < 300.0f)) {
            temp_f29 = ((arg0->z - var_r31->unkC.z) * (arg0->z - var_r31->unkC.z)) + (((arg0->x - var_r31->unkC.x) * (arg0->x - var_r31->unkC.x)) + ((arg0->y - var_r31->unkC.y) * (arg0->y - var_r31->unkC.y)));
            if (!(temp_f29 > var_f30)) {
                var_r27 = var_r29;
                var_f30 = temp_f29;
            }
        }
    }
    *arg1 = sqrtf(var_f30);
    return var_r27;
}

